Repository: knipknap/doorman-app
Catalog: lib/l10n/app_*.arb
Languages: pt

# statusConnecting
source: Connecting
pt: Conectando

# statusLogin
source: Trying to log in
pt: Fazendo login

# statusLogout
source: Logging out
pt: Fazendo logout

source: Hostname
pt: Nome do servidor

source: Next
pt: Próximo

source: Password
pt: Senha

# invalidCredentials
source: Invalid credentials, please try again.
pt: Detalhes de login inválidos, por favor tente novamente.

# button1DefaultLabel
source: Front Door
pt: Porta de frente

# button2DefaultLabel
source: Apartment
pt: Porta do apartamento

source: Settings
pt: Configurações

source: Logout
pt: Sair

# appSettings
source: Application Settings
pt: Configurações

source: Hub settings
pt: Configurações de servidor

# errInvalidHostname
source: Invalid hostname format
pt: O formato do nome do host não é válido

source: Port number
pt: Porta

# errMissingPortNumber
source: A port number is required
pt: Porta é obgriadorio

# errInvalidPortNumber
source: Invalid port number
pt: Porta inválido

source: Button settings
pt: Rotulagem do botão

# buttonLabel
source: {count, plural, zero{First button text} one{Second button text} other{Button {count}}}
pt: {count, plural, zero{Primeiro botão} one{Segundo botão} other{Botão {count}}}

# errLabelTooLong
source: Text too long
pt: Texto muito longo
